In [1]:
# 여기에 어떤 csv 데이터를 넣어도 자동으로 labelencoding, onehotencodign을 해줄것이다.
import pandas as pd
df = pd.read_csv(r"https://raw.githubusercontent.com/the9world/My_Study/main/data/Data.csv") ; df
# Salary(급여)	Purchased(구입, 구매),   y가 'Purchased'나 kmeans 클러스터링

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [2]:
df.describe() # 숫자로 된 값들로 정보를 만듬

             Age        Salary
count   9.000000      9.000000
mean   38.777778  63777.777778
std     7.693793  12265.579662
min    27.000000  48000.000000
25%    35.000000  54000.000000
50%    38.000000  61000.000000
75%    44.000000  72000.000000
max    50.000000  83000.000000

In [3]:
df.isna().sum() # 결측치 확인

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [4]:
df = df.dropna() ; df # 결측치 제거,  결측치를 다른 값으로 대체 하려면 따로 수정,  변수에 담으면 제거 후 저장
# 여기서 인덱스 reset_index 안하면 인덱스 값이 이상한채로 시작됨

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
5   France  35.0  58000.0       Yes
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [5]:
df.reset_index(inplace = True, drop=True) 
df # 드랍한놈들 때문에 인덱스값 초기화해주기 inplace원본에 수정, drop???

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4   France  35.0  58000.0       Yes
5   France  48.0  79000.0       Yes
6  Germany  50.0  83000.0        No
7   France  37.0  67000.0       Yes

In [36]:
df.loc[ : , ['Country', 'Salary'] ]  # 3. X(df)로 사용할 컬럼을 사용할 수 있다. code : 행은 전체, 열은 2개
# 이것과 아래는 같은 방법(?)

   Country   Salary
0   France  72000.0
1    Spain  48000.0
2  Germany  54000.0
3    Spain  61000.0
4   France  58000.0
5   France  79000.0
6  Germany  83000.0
7   France  67000.0

In [37]:
X= df.loc[ : , : ] ; X  # 3. X(df)로 사용할 컬럼을 사용할 수 있다. code : 행은 전체, 열도 전체 + 변수 할당

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4   France  35.0  58000.0       Yes
5   France  48.0  79000.0       Yes
6  Germany  50.0  83000.0        No
7   France  37.0  67000.0       Yes

In [8]:
# 각 컬럼별로 문자인지 숫자인지 확인해야 한다.
# 문자열이면 데이터 값이 2개 종류인지, 3종류 이상의 데이터인지 확인한다.
# 확인이 끝나면, LabelEncoding(2개) OR OneHotEncoding(3개 이상) 이용해서 숫자로 바꿔준다.
# 어떤 데이터가 들어오든 데이터가 문자열인지, 숫자형인지 확인하기

In [9]:
X.columns # 컬럼명 확인, 컬럼들 이름을 순서대로 알려줌.

Index(['Country', 'Age', 'Salary', 'Purchased'], dtype='object')

In [10]:
X.columns[0] # 0번 컬럼 가져오기

'Country'

In [11]:
df[ X.columns[0] ] # df[], df.loc[], df.iloc 데이터 가져오는 방법 종류,  code: 0번 컬럼 값 보기, object : 문자열
# df[ X.columns[0] ] df 열을 X변수에 저장된 것(열)을 불러온다.

0     France
1      Spain
2    Germany
3      Spain
4     France
5     France
6    Germany
7     France
Name: Country, dtype: object

In [12]:
df[ X.columns[0] ].dtype==object # dtype:데이터 타입 확인하기, ==object 문자열이냐고 물어보기, 이항(boolean)으로 답함

True

In [13]:
df[ X.columns[1] ].dtype==int # ==int 숫자(정수형)냐고 물어보기, 이항(boolean)으로 답함

False

In [14]:
df[ X.columns[1] ].dtype==float # ==float 숫자(플롯형)냐고 물어보기, boolean형으로 답함

True

In [42]:
# 인코딩하기 위해 데이터 종류 갯수 확인
df[ X.columns[0] ]

0     France
1      Spain
2    Germany
3      Spain
4     France
5     France
6    Germany
7     France
Name: Country, dtype: object

In [43]:
df[ X.columns[0] ]. nunique() # 3개 니까 원핫인코딩을 하자

3

In [17]:
# 원핫인코딩은 한 번에 여러 컬럼이 가능하므로
# 먼저 레이블 인코딩이 가능한 컬럼 먼저 처리하고, 그 후에 원핫인코딩을 수행한다.
from sklearn.preprocessing import LabelEncoder, OneHotEncoder
from sklearn.compose import ColumnTransformer # 강사님 방식
X # Country는 3개니까 원핫인코딩, Purchased은 2개니까 레이블인코딩

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4   France  35.0  58000.0       Yes
5   France  48.0  79000.0       Yes
6  Germany  50.0  83000.0        No
7   France  37.0  67000.0       Yes

In [18]:
X.columns

Index(['Country', 'Age', 'Salary', 'Purchased'], dtype='object')

In [19]:
# 비어있는 데이터 프레임을 만든다. (for문 후 인코딩하고 새로운 열을 만든 것을 여기에 할당 예정)
X_new= pd.DataFrame() 

for name in X.columns : # X에 들어있는 컬럼들을 순서대로 print로 확인 후 print는 주석 처리 후 진행
  # print(name)

  # 데이터의 종류가 문자열이면, 데이터의 종류가 몇개인지 확인한다.
  if X[ name ].dtype == object :
    if X[name].nunique() >= 3: # 0, 1, +@로 X_new에 붙여라
      # 데이터 종류가 3개 보다 크거나 원핫인코딩 한다.
      ct= ColumnTransformer( [ (' encoder ' , OneHotEncoder() , [0] ) ] ,
                            remainder='passthrough')
# 'encoder'= 출력할 문자, OneHotEncoder()= 인코딩방식, [0]= 컬럼, remainder= 'passthrough'= ..? 모지?
      col_names= sorted( X[name].unique() )
      X_new[col_names]= ct.fit_transform( X [ X.columns[ 0 ] ].to_frame()) # 2차원으로 바꾼 것을 다시 fit_transform

    else: # 0, 1로 X_new에 붙여라
      # 1~2개면 레이블 인코딩 한다.
      label_encoder = LabelEncoder() # 2개니까 레이블인코딩 한다
      X_new[name]= label_encoder.fit_transform(X[name]) # 잘 찾아봐라

  # 숫자 데이터일 때의 처리는 여기서 (int, float)
  else : 
    X_new[name] = X[name]

# ex) for문 해서 1번 컬럼이 문자열이 아니면 그대로 가져와서 비어있는 데이터 프레임에 입력
# 2번 컬럼이 문자열이면 nunique 확인하구 2개면 레이블 인코딩 3개이상이면 원핫인코딩 후 비어있는 데이터 프레임에 입력
# 인코딩 한 만큼 열을 생성한다. 이런식으로 모든 컬럼을 확인 후 숫자만 있는 새로운 데이터 프레임을 만들게 된다.
# 최종으로 만들어진 최종 데이터로 데이터분석 하는 것이 효율적.

In [20]:
X # for문 실행 후에 확인 하는 것

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4   France  35.0  58000.0       Yes
5   France  48.0  79000.0       Yes
6  Germany  50.0  83000.0        No
7   France  37.0  67000.0       Yes

In [21]:
X_new  # 먼가 이상하다고 X 만들때 인덱스 초기화하래 reset_index?

   France  Germany  Spain   Age   Salary  Purchased
0     1.0      0.0    0.0  44.0  72000.0          0
1     0.0      0.0    1.0  27.0  48000.0          1
2     0.0      1.0    0.0  30.0  54000.0          0
3     0.0      0.0    1.0  38.0  61000.0          0
4     1.0      0.0    0.0  35.0  58000.0          1
5     1.0      0.0    0.0  48.0  79000.0          1
6     0.0      1.0    0.0  50.0  83000.0          0
7     1.0      0.0    0.0  37.0  67000.0          1

In [22]:
X[X.columns[0]] # [0] : Country 컬럼

0     France
1      Spain
2    Germany
3      Spain
4     France
5     France
6    Germany
7     France
Name: Country, dtype: object

In [23]:
sorted(X[X.columns[0]].unique()) # sorted 알파벳 순 정렬, unique 중복 제거한 국가,  즉 중복을 제거한 국가를 알파벳 순으로 정렬
# 1 0 0
# 0 1 0
# 0 0 1 이런 식으로 바꿀 예정

['France', 'Germany', 'Spain']

In [24]:
ct= ColumnTransformer( [ (' encoder ' , OneHotEncoder() , [0] ) ] , # 1번=출력할 문자, 2번=인코딩방식, 3=[0] 컬럼
                      remainder='passthrough') # 4번은.. 모지?

In [25]:
# ct.fit_transform( X [ X.columns[ 0 ] ] )  이 코드는 shape 문제로 error,X [ X.columns[ 0 ]은 1차원임, 2차원으로 입력해야함

In [26]:
X[X.columns[ 0 ] ].to_frame() # 2차원으로 바꾸기

   Country
0   France
1    Spain
2  Germany
3    Spain
4   France
5   France
6  Germany
7   France

In [27]:
ct.fit_transform( X [ X.columns[ 0 ] ].to_frame()) # 2차원으로 바꾼 것을 다시 fit_transform

array([[1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [0., 0., 1.],
       [1., 0., 0.],
       [1., 0., 0.],
       [0., 1., 0.],
       [1., 0., 0.]])

In [28]:
sorted(X[ X.columns[ 0 ] ].unique()) # 아까 했던 것과 같음 중복제거 후 알파벳순 정열

['France', 'Germany', 'Spain']

In [29]:
X[X.columns[3]] # 3번 열도 인코딩 준비

0     No
1    Yes
2     No
3     No
4    Yes
5    Yes
6     No
7    Yes
Name: Purchased, dtype: object

In [30]:
X[X.columns[3]].nunique() # 3번 열 데이터가 몇개인지 확인, 인코딩 시작

2

In [31]:
label_encoder = LabelEncoder() # 2개니까 레이블인코딩 한다

In [32]:
label_encoder.fit_transform(X[X.columns[3]])

array([0, 1, 0, 0, 1, 1, 0, 1])

In [33]:
# ex) for문 해서 1번 컬럼이 문자열이 아니면 그대로 가져와서 비어있는 데이터 프레임에 입력
# 2번 컬럼이 문자열이면 nunique 확인하구 2개면 레이블 인코딩 3개이상이면 원핫인코딩 후 비어있는 데이터 프레임에 입력
# 인코딩 한 만큼 열을 생성한다. 이런식으로 모든 컬럼을 확인 후 숫자만 있는 새로운 데이터 프레임을 만들게 된다.
# 최종으로 만들어진 최종 데이터로 데이터분석 하는 것이 효율적.